let PetDogs [
    {
        Id = 1,
        Name = "Rottweiler",
        Img = "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-07/rotweiller.jpg",
        Description = "ร็อตไวเลอร์เป็นสุนัขพันธุ์ใหญ่ที่มีต้นกำเนิดจากประเทศเยอรมนี ด้วยรูปลักษณ์ภายนอกที่น่าเกรงขาม อาจทำให้คนทั่วไปคิดว่าร็อตไวเลอร์เป็นสุนัขดุร้าย แต่ในความเป็นจริงนั้น พวกเค้าเป็นเพียงหมาใหญ่ใจดี เริ่มแรกสุนัขร็อตไวเลอร์ถู-กเพาะพันธุ์มาเพื่อต้อนฝูงสัตว์และใช้ลากเกวียนขนาดเล็ก พวกเค้ามีขนสองชั้น มีหางสั้น จมูกยาวปานกลาง และมีใบหูสั้นห้อยลงมา หากสังเกตให้ดีจะพบว่าร็อตไวเลอร์มีดวงตาสีน้ำตาลและมีจมูกสีดำ พวกเค้ามีขาหลังที่แข็งแรงมาก ซึ่งเป็นเครื่องยืนยันถึงความแข็งแกร่งและการทำงานอย่างหนักของบรรพบุรุษ",
        Overview = "น้ำหนัก : สุนัขร็อตไวเลอร์ที่มีสุขภาพดีจะมีน้ำหนักระหว่าง 36 – 61 กก. \nส่วนสูง : ส่วนสูงโดยเฉลี่ยของสุนัขร็อตไวเลอร์ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 22 – 27 นิ้ว \n อายุขัย : สุนัขพันธุ์นี้มีอายุขัยเฉลี่ยอยู่ที่ 9 – 10 ปี \n ลักษณะขน : ร็อตไวเลอร์มีขนสองชั้น ยาวปานกลาง",
        Character = "น้ำหนัก : สุนัขร็อตไวเลอร์ที่มีสุขภาพดีจะมีน้ำหนักระหว่าง 36 – 61 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของสุนัขร็อตไวเลอร์ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 22 – 27 นิ้ว \n" +
        "อายุขัย : สุนัขพันธุ์นี้มีอายุขัยเฉลี่ยอยู่ที่ 9 – 10 ปี \n" +
        "ลักษณะขน : ร็อตไวเลอร์มีขนสองชั้น ยาวปานกลาง",
        Character = "ร็อตไวเลอร์เป็นสุนัขที่เชื่อฟังมาก และสามารถฝึกได้ง่าย \n" +
        "สุนัขร็อตไวเลอร์มีความจงรักภักดีสูง ทั้งรักและติดเจ้าของ \n" +
        "สายพันธุ์นี้ค่อนข้างนิ่งและสงบ จนบางครั้งอาจดูเหมือนพวกเค้ารักสันโดษ \n" +
        "สุนัขพันธุ์ร็อตไวเลอร์ไม่ชอบการอยู่ลำพังเป็นเวลานาน ๆ หลายชั่วโมง หากต้องการปล่อยให้อยู่คนเดียวอาจต้องฝึกพวกเค้าอย่างเหมาะสม \n" +
        "สุนัขพันธุ์นี้มีสัญชาตญาณในการป้องกันสูง พวกเค้าพร้อมจะปกป้องคนที่รัก และจะคอยระวังคนแปลกหน้าอยู่เสมอ"
    },
    {
        Id = 2,
        Name = "Golden Retriever",
        Img = "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_afc2fa4a-40a7-4e3d-bb2c-d605117ed0bd.jpg",
        Description = "เจ้าสุนัขตัวโตขนฟูอย่างโกลเด้น รีทรีฟเวอร์นั้น เป็นสุนัขพันธุ์ใหญ่ที่มีถิ่นกำเนิดจากประเทศสกอตแลนด์ จุดเด่นคือขนสีทองอร่ามตามชื่อสายพันธุ์ โกลเด้นยังขึ้นชื่อเรื่องความอ่อนโยน และเชื่อฟังคำสั่งเจ้าของเป็นอย่างดี ไม่ว่าใครก็ต้องใจละลายเพราะหน้าตาแสนน่ารักของพวกเค้าอย่างแน่นอน!",
        Overview = "น้ำหนัก: น้ำหนักโดยเฉลี่ยของสุนัขโกลเด้น รีทรีฟเวอร์อยู่ระหว่าง 24.9 – 34 กก. \n" +
        "ส่วนสูง: ส่วนสูงโดยเฉลี่ยของโกลเด้น รีทรีฟเวอร์คือ 21.5 – 24 นิ้ว \n" +
        "อายุขัย: โกลเด้น รีทรีฟเวอร์มีอายุขัยเฉลี่ยอยู่ที่ 10 – 12 ปี \n" +
        "ลักษณะขน: สุนัขโกลเด้น รีทรีฟเวอร์มีขนยาวและหนา 2 ชั้น มีสีขนที่หลากหลาย",
        Character = "ด้วยนิสัยเป็นมิตร เราสามารถปล่อยให้โกลเด้น รีทรีฟเวอร์อยู่ร่วมกับเด็ก ๆ ได้โดยไร้กังวล \n" +
        "สุนัขโกลเด้น รีทรีฟเวอร์ฝึกได้ง่าย และชอบเอาใจเจ้าของด้วยการเรียนรู้ทริคต่าง ๆ อย่างรวดเร็ว \n" +
        "สุนัขพันธุ์นี้มีแนวโน้มที่จะกัดแทะสิ่งของ ดังนั้นจึงควรเก็บของที่แตกง่ายและข้าวของสำคัญให้มิดชิด \n" +
        "โกลเด้นจะเห่าเมื่อจำเป็นเท่านั้น \n" +
        "สุนัขโกลเด้น รีทรีฟเวอร์ซื่อสัตย์ และจงรักภักดี พวกเค้าเหมาะกับผู้เลี้ยงมือใหม่เป็นที่สุด"
    },
    {
        Id = 3,
        Name = "Bichon Frise",
        Img = "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_6f31ed94-1b3f-48ff-a760-26cda23d1ec5.jpg",
        Description = "สำหรับมือใหม่หัดเลี้ยง น้องบิชอง ฟริเซ่เป็นหนึ่งในตัวเลือกที่ดีเลย ด้วยความเป็นมิตรและจงรักภักดี น้องหมาแสนน่ารักตัวนี้จึงเป็นเพื่อนที่ยอดเยี่ยม นอกจากนี้สุนัขบิชอง ฟริเซ่ยังเหมาะสำหรับคนที่เป็นภูมิแพ้อีกด้วย เรียกว่าเป็นน้องหมาในฝันของใครหลาย ๆ คนเลย แต่ก่อนจะรับกลับบ้าน อย่าลืมพาน้องหมาไปตรวจสุขภาพให้เรียบร้อย เพื่อให้แน่ใจว่าพวกเค้าแข็งแรงและไม่มีอาการเจ็บป่วย",
        Overview = "น้ำหนัก : สุนัขบิชอง ฟริเซ่ที่มีสุขภาพดีจะมีน้ำหนักระหว่าง 3 – 5 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของสุนัขบิชอง ฟริเซ่ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 22 – 27 ซม. \n" +
        "อายุขัย : สุนัขพันธุ์นี้มีอายุขัยเฉลี่ยอยู่ที่ 12 – 15 ปี \n" +
        "ลักษณะขน : ขนสองชั้น – ขนชั้นในนุ่มและหนา ขนชั้นนอกหยิกแต่นุ่มน่าสัมผัส",
        Character = "บิชอง ฟริเซ่เป็นสุนัขที่น่ารัก นิสัยดี เป็นมิตร อ่อนโยน และรักครอบครัวมาก \n" +
        "พวกเค้าจึงเป็นเพื่อนที่ดีและเป็นสมาชิกครอบครัวที่ยอดเยี่ยม \n" +
        "เจ้าก้อนขนฟูเหล่านี้เหมาะสำหรับเลี้ยงในบ้านมากกว่านอกบ้าน พวกเค้าพร้อมเล่นและพร้อมพุ่งตัวเข้าสู่อ้อมกอดเจ้าของอยู่ตลอดเวลา \n" +
        "เป็นสายพันธุ์ที่เต็มไปด้วยพลังบวกและความสดใส พวกเค้าจึงเหมาะกับคนในทุกช่วงวัย นอกจากนี้พวกเค้ายังเข้ากับสัตว์เลี้ยงชนิดอื่นได้ดี \n" +
        "หากแนะนำและเข้าหาอย่างถูกวิธี"
    },
    {
        Id = 4,
        Name = "Maltese",
        Img = "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_491f81c2-a286-4d2a-b736-b00d44ebde92.jpg",
        Description = "มอลทีสจัดอยู่ในกลุ่มสุนัขพันธุ์ทอยที่ชอบให้กอดและอุ้มนั่งตักเป็นที่สุด! มอลทีสเป็นสุนัขน่ารักน่าเอ็นดู เรียกว่าเป็นสายพันธุ์ที่เหมาะสำหรับครอบครัวและเจ้าของมือใหม่ ด้วยขนาดตัวที่เล็ก ไม่ต้องการพื้นที่มากมาย จึงเหมาะจะเลี้ยงในอพาร์ทเมนท์ ขนของสุนัขพันธุ์นี้มีลักษณะพิเศษเฉพาะตัว โดยจะมีขนสีขาวบริสุทธิ์คล้ายเส้นไหม ยาวปกคลุมถึงข้อเท้า รวมถึงมีใบหูห้อยยาวลงมาถึงบริเวณกราม และมีรูปร่างสมส่วน นอกจากนี้มอลทีสยังมีนิสัยร่าเริง เข้ากับคนง่าย น่ารักจนคนที่พบเห็นตกหลุมรักได้ไม่ยาก สำหรับมอลทีส อุปนิสัยที่พบได้คือความเป็นมิตรและความอ่อนโยน พวกเค้าเป็นสุนัขที่เฉลียวฉลาด ซื่อสัตย์ ติดเจ้าของ มีชีวิตชีวา มีพลังงานไม่มากไม่น้อย ชอบเล่นซนและเที่ยวเล่นได้ทั้งวัน ทั้งนี้มอลทีสชอบเห่าตลอดเวลา เห่าเมื่อมีความสุขหรือรู้สึกไม่พอใจ สุนัขสายพันธุ์นี้เหมาะกับการเลี้ยงในอากาศเย็น แต่ก็สามารถปรับตัวได้ดีในทุกสภาพอากาศเช่นกัน",
        Overview = "น้ำหนัก : สุนัขมอลทีสที่มีสุขภาพดีจะมีน้ำหนักประมาณ 3 – 4 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของมอลทีสในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 7 – 9 นิ้ว \n" +
        "อายุขัย : สุนัขสายพันธุ์นี้จะมีอายุขัยเฉลี่ยอยู่ที่ 12 – 15 ปี \n" +
        "ลักษณะขน: มอลทีสมีขนสีขาวยาวสลวย นุ่มน่าสัมผัส",
        Character = "สุนัขมอลทีสเข้ากับเด็ก ผู้สูงอายุ และสัตว์เลี้ยงชนิดอื่นได้ดีมอลทีสชอบเล่นและฝึกได้ง่ายแม้จะมีขนยาว แต่ขนไม่ค่อยร่วง-มอลทีสเหมาะกับการเลี้ยงในพื้นที่น้อยอย่างในอพาร์ทเมนท์สุนัขพันธุ์นี้ไม่จำเป็นต้องออกกำลังกายหนัก"
    }
];
let PetCats [
    {
        Id = 1,
        Name = "Sphinx",
        Img = "https://www.purina.co.th/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0003_Sphynx.webp?itok=AJfdmSmY",
        Description = "จุดเด่นของแมวสฟิงซ์คือเป็นแมว “ไร้ขน” แม้ดูภายนอกจะเหมือนแมวไร้ขน แต่อันที่จริงแล้วสฟิงซ์มีขนนุ่มละเอียดปกคลุมทั่วรางกาย ให้สัมผัสเหมือนเปลือกลูกพีช แมวพันธุ์นี้ไม่มีหนวดและขนตา หัวมีรูปทรงคล้ายกับหัวของแมวเดวอน เร็กซ์ ดวงตาลึกกลมคล้ายเลมอน รูปร่างของสฟิงซ์บอบบางแต่มีกล้ามเนื้อ อกหนากลม ขาเรียวยาวและดูโก่งจากอกทรงกลม หางยาวเรียวและสากเมื่อสัมผัส",
        Overview = "น้ำหนัก : สฟิงซ์ที่มีสุขภาพดีจะมีน้ำหนักประมาณ 3.6-7.2 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของสฟิงซ์ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 20-25 ซม. \n" +
        "อายุขัย : สฟิงซ์มีอายุขัยเฉลี่ยประมาณ 13-14 ปี \n" +
        "ลักษณะขน : สฟิงซ์อาจไม่มีขนเลย หรืออาจมีขนเหมือนพีชที่สั้นและละเอียดมาก",
        Character = "แมวสฟิงซ์เข้าสังคมเก่ง ซุกซน เป็นมิตร และชอบให้คนสนใจ แมวไร้ขนพันธุ์นี้มักคอยต้อนรับเจ้าของเมื่อกลับถึงบ้าน และยังคุยเก่งอีกด้วย เป็นแมวที่ฉลาด ขี้เล่น และน่ากอด สฟิงซ์เป็นสุดยอดแมว “ขี้อ้อน” ชอบนอนใต้ผ้าห่มกับเจ้าของ อุณหภูมิร่างกายของสฟิงซ์สูงกว่าแมวทั่วไปโดยเฉลี่ย 1-2 องศา",
    },
    {
        Id = 2,
        Name = "Maine Coon",
        Img = "https://www.purina.co.th/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0022_Maine_coon.webp?itok=LhD0vLe7",
        Description = "แมวเมนคูนเป็นสายพันธุ์แมวขนาดใหญ่ที่สุดในโลก รูปร่างแข็งแรงกำยาและขาแข็งแรง หัวทรงเหลี่ยม ใบหูใหญ่และตั้งตรง ขนด้านนอกมีลักษณะยาวหนาเป็นมันและกันน้ำได้ดี มีขนชั้นในซ่อนอยู่ข้างใต้ ส่วนขนที่หัว คอและไหล่จะสั้นกว่าจุดอื่นแต่จะค่อย ๆ ยาวขึ้นเรื่อย ๆ บริเวณส่วนหลัง ข้างลำตัวและหาง ส่วนท้องกับสะโพกมีขนดกและหนา ที่โคนหูจะมีขนยาวเป็นพู่งามสง่า",
        Overview = "น้ำหนัก : แมวสายพันธุ์เมนคูนมักจะมีน้ำหนักประมาณ 5 – 8 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของเมนคูนในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 16-18 \n" +
        "อายุขัย : เมนคูนมีอายุขัยเฉลี่ยประมาณ 15-17 ปีขึ้นไป \n" +
        "ลักษณะขน : เจ้าเหมียวพันธุ์เมนคูนมีขนหนาและยาวคล้ายเส้นไหม",
        Character = "แมวเมนคูนมีนิสัยอ่อนโยน ขี้เล่นและเป็นมิตร ชอบอยู่ใกล้คนและเป็นสัตว์เลี้ยงที่ดี อาจเป็นเพราะลักษณะที่ไม่เย่อหยิ่งทำให้พบแมวเมนคูนนอนขดอยู่ในที่แปลก ๆ ได้",
    },
    {
        Id = 3,
        Name = "Persian",
        Img = "https://www.purina.co.th/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0015_Persian.webp?itok=e3BqIEsK",
        Description = "แมวเปอร์เซีย หรือ Persian Cat คือหนึ่งในสายพันธุ์น้องแมวขนสวยยาวเงางาม และจัดเป็นหนึ่งในสิบสายพันธุ์แมว ที่ได้รับความนิยมนำมาเลี้ยงมากที่สุดบนโลกสายพันธุ์หนึ่ง ด้วยขนที่สวย บวกกับความน่ารัก ความจงรักภักดีต่อเจ้าของ รักความสงบ ไม่ส่งเสียงดังเอะอะ และความฉลาดแสนรู้ของแมวเปอร์เซีย ทำให้น้องแมวสายพันธุ์นี้มัดใจให้หลายคนตกหลุมรักกันแบบถอนตัวไม่ขึ้น",
        Overview = "น้ำหนัก : เปอร์เซียที่มีสุขภาพดีจะมีน้ำหนักประมาณ 3 – 5 กก.\n" +
        "ความสูง : ส่วนสูงโดยเฉลี่ยของเปอร์เซียในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 10 – 15 นิ้ว \n" +
        "อายุขัย : สฟิงซ์มีอายุขัยเฉลี่ยประมาณ 12 – 17 ปี \n" +
        "ลักษณะขน : ขนยาวสลวย หนาสองชั้น",
        Character = "แมวเปอร์เซียจะค่อนข้างเงียบและไม่ซุกซน ชอบที่จะนั่งนิ่งๆ อยู่ข้างกายเจ้าของแบบสงบเสงี่ยม มีความเป็นมิตรกับสมาชิกในครอบครัวรวมทั้งเด็ก แต่จะไม่ชอบถ้าเด็กหรือสัตว์เลี้ยงตัวอื่นมากวน หรือมายุ่งวุ่นวาย และมักเป็นแมวที่ได้รับความสนใจจากสมาชิกในครอบครัว แต่มีเพียงไม่กี่คนหรอกนะที่น้องแมวเปอร์เซียจะรู้สึกไว้ใจ",
    },
    {
        Id = 4,
        Name = "British Shorthair",
        Img = "https://www.purina.co.th/sites/default/files/styles/ttt_image_original/public/2021-02/CAT%20BREED%20Hero%20Desktop_0036_British_shorthair.webp?itok=UToBSCFZ",
        Description = "ทำความรู้จักบริติช ช็อตแฮร์ (British Shorthair) ว่ากันว่า British shorthair เป็นหนึ่งในสายพันธุ์แมวที่เก่าแก่ที่สุดของประเทศอังกฤษ ด้วยลักษณะเด่นที่มีขนหนานุ่มน่ากอด กับนิสัยเท่ๆ ถึงจะอยู่แบบเงียบๆ แต่ก็เข้ากับทุกคนได้ง่าย แถมยังเป็นมิตรอีกต่างหากถ้าใครกำลังมองหาเพื่อนแท้ซักตัวที่จะอยู่เคียงข้างแบบไม่กวนใจ มองมาทางนี้เลย",
        Overview = "น้ำหนัก : บริติช ช็อตแฮร์ที่มีสุขภาพดีจะมีน้ำหนักประมาณ 4 – 7 กก. \n" +
        "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของบริติช ช็อตแฮร์ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 12 – 14 นิ้ว \n" +
        "อายุขัย : บริติช ช็อตแฮร์มีอายุขัยเฉลี่ยประมาณ 12 – 15 ปี \n" +
        "ลักษณะขน : แม้จะมีขนสั้น แต่ขนของบริติช ช็อตแฮร์ก็หนาและแน่นมาก",
        Character = "น้องแมวบริติช ช็อตแฮร์ นั้นน่ารัก เรียบร้อย และเข้ากับคนอื่นง่าย ทำให้น้องกลายเป็นแมวเลี้ยงที่ลงตัวมากสำหรับครอบครัว น้องแมวบริติช ช็อตแฮร์ ชอบที่จะเป็นรักและสนใจจากคนรอบข้าง แต่ก็ไม่ได้เรียกร้องความสนใจจนมากเกินไป น้องมักชอบเดินตามเจ้าของไปรอบๆ บ้านแล้วนั่งลงข้างๆ ไม่ว่าคุณจะทำอะไร",
    },
];