namespace MVC_Homework.DearFriend
{
    public class DearFriendDog
    {
        public static List<string> Name { get; set; } = new List<string>()
        {
            "Rottweiler","Golden Retriever","Bichon Frise","Maltese"
        };

        public static List<string> Img { get; set; } = new List<string>()
        {
            "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-07/rotweiller.jpg",
            "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_afc2fa4a-40a7-4e3d-bb2c-d605117ed0bd.jpg",
            "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_6f31ed94-1b3f-48ff-a760-26cda23d1ec5.jpg",
            "https://www.pedigree.co.th/cdn-cgi/image/width=520,format=auto,q=90/sites/g/files/fnmzdf3521/files/2022-04/large_491f81c2-a286-4d2a-b736-b00d44ebde92.jpg"
        };
        
        public static List<string> Description { get; set; } = new List<string>()
        {
            "ร็อตไวเลอร์เป็นสุนัขพันธุ์ใหญ่ที่มีต้นกำเนิดจากประเทศเยอรมนี ด้วยรูปลักษณ์ภายนอกที่น่าเกรงขาม อาจทำให้คนทั่วไปคิดว่าร็อตไวเลอร์เป็นสุนัขดุร้าย แต่ในความเป็นจริงนั้น พวกเค้าเป็นเพียงหมาใหญ่ใจดี เริ่มแรกสุนัขร็อตไวเลอร์ถู-กเพาะพันธุ์มาเพื่อต้อนฝูงสัตว์และใช้ลากเกวียนขนาดเล็ก พวกเค้ามีขนสองชั้น มีหางสั้น จมูกยาวปานกลาง และมีใบหูสั้นห้อยลงมา หากสังเกตให้ดีจะพบว่าร็อตไวเลอร์มีดวงตาสีน้ำตาลและมีจมูกสีดำ พวกเค้ามีขาหลังที่แข็งแรงมาก ซึ่งเป็นเครื่องยืนยันถึงความแข็งแกร่งและการทำงานอย่างหนักของบรรพบุรุษ",
            "เจ้าสุนัขตัวโตขนฟูอย่างโกลเด้น รีทรีฟเวอร์นั้น เป็นสุนัขพันธุ์ใหญ่ที่มีถิ่นกำเนิดจากประเทศสกอตแลนด์ จุดเด่นคือขนสีทองอร่ามตามชื่อสายพันธุ์ โกลเด้นยังขึ้นชื่อเรื่องความอ่อนโยน และเชื่อฟังคำสั่งเจ้าของเป็นอย่างดี ไม่ว่าใครก็ต้องใจละลายเพราะหน้าตาแสนน่ารักของพวกเค้าอย่างแน่นอน!",
            "สำหรับมือใหม่หัดเลี้ยง น้องบิชอง ฟริเซ่เป็นหนึ่งในตัวเลือกที่ดีเลย ด้วยความเป็นมิตรและจงรักภักดี น้องหมาแสนน่ารักตัวนี้จึงเป็นเพื่อนที่ยอดเยี่ยม นอกจากนี้สุนัขบิชอง ฟริเซ่ยังเหมาะสำหรับคนที่เป็นภูมิแพ้อีกด้วย เรียกว่าเป็นน้องหมาในฝันของใครหลาย ๆ คนเลย แต่ก่อนจะรับกลับบ้าน อย่าลืมพาน้องหมาไปตรวจสุขภาพให้เรียบร้อย เพื่อให้แน่ใจว่าพวกเค้าแข็งแรงและไม่มีอาการเจ็บป่วย",
            "มอลทีสจัดอยู่ในกลุ่มสุนัขพันธุ์ทอยที่ชอบให้กอดและอุ้มนั่งตักเป็นที่สุด! มอลทีสเป็นสุนัขน่ารักน่าเอ็นดู เรียกว่าเป็นสายพันธุ์ที่เหมาะสำหรับครอบครัวและเจ้าของมือใหม่ ด้วยขนาดตัวที่เล็ก ไม่ต้องการพื้นที่มากมาย จึงเหมาะจะเลี้ยงในอพาร์ทเมนท์ ขนของสุนัขพันธุ์นี้มีลักษณะพิเศษเฉพาะตัว โดยจะมีขนสีขาวบริสุทธิ์คล้ายเส้นไหม ยาวปกคลุมถึงข้อเท้า รวมถึงมีใบหูห้อยยาวลงมาถึงบริเวณกราม และมีรูปร่างสมส่วน นอกจากนี้มอลทีสยังมีนิสัยร่าเริง เข้ากับคนง่าย น่ารักจนคนที่พบเห็นตกหลุมรักได้ไม่ยาก สำหรับมอลทีส อุปนิสัยที่พบได้คือความเป็นมิตรและความอ่อนโยน พวกเค้าเป็นสุนัขที่เฉลียวฉลาด ซื่อสัตย์ ติดเจ้าของ มีชีวิตชีวา มีพลังงานไม่มากไม่น้อย ชอบเล่นซนและเที่ยวเล่นได้ทั้งวัน ทั้งนี้มอลทีสชอบเห่าตลอดเวลา เห่าเมื่อมีความสุขหรือรู้สึกไม่พอใจ สุนัขสายพันธุ์นี้เหมาะกับการเลี้ยงในอากาศเย็น แต่ก็สามารถปรับตัวได้ดีในทุกสภาพอากาศเช่นกัน"
        };

        public static List<string> Overview { get; set; } = new List<string>()
        {
            "น้ำหนัก : สุนัขร็อตไวเลอร์ที่มีสุขภาพดีจะมีน้ำหนักระหว่าง 36 – 61 กก. \n" +
            "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของสุนัขร็อตไวเลอร์ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 22 – 27 นิ้ว \n" +
            "อายุขัย : สุนัขพันธุ์นี้มีอายุขัยเฉลี่ยอยู่ที่ 9 – 10 ปี \n" +
            "ลักษณะขน : ร็อตไวเลอร์มีขนสองชั้น ยาวปานกลาง",

            "น้ำหนัก: น้ำหนักโดยเฉลี่ยของสุนัขโกลเด้น รีทรีฟเวอร์อยู่ระหว่าง 24.9 – 34 กก. \n" +
            "ส่วนสูง: ส่วนสูงโดยเฉลี่ยของโกลเด้น รีทรีฟเวอร์คือ 21.5 – 24 นิ้ว \n" +
            "อายุขัย: โกลเด้น รีทรีฟเวอร์มีอายุขัยเฉลี่ยอยู่ที่ 10 – 12 ปี \n" +
            "ลักษณะขน: สุนัขโกลเด้น รีทรีฟเวอร์มีขนยาวและหนา 2 ชั้น มีสีขนที่หลากหลาย",

            "น้ำหนัก : สุนัขบิชอง ฟริเซ่ที่มีสุขภาพดีจะมีน้ำหนักระหว่าง 3 – 5 กก. \n" +
            "ส่วนสูง : ส่วนสูงโดยเฉลี่ยของสุนัขบิชอง ฟริเซ่ในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 22 – 27 ซม. \n" +
            "อายุขัย : สุนัขพันธุ์นี้มีอายุขัยเฉลี่ยอยู่ที่ 12 – 15 ปี \n" +
            "ลักษณะขน : ขนสองชั้น – ขนชั้นในนุ่มและหนา ขนชั้นนอกหยิกแต่นุ่มน่าสัมผัส",

            "น้ำหนัก: สุนัขมอลทีสที่มีสุขภาพดีจะมีน้ำหนักประมาณ 3 – 4 กก. \n" +
            "ส่วนสูง: ส่วนสูงโดยเฉลี่ยของมอลทีสในช่วงโตเต็มวัยจะอยู่ที่ประมาณ 7 – 9 นิ้ว \n" +
            "อายุขัย: สุนัขสายพันธุ์นี้จะมีอายุขัยเฉลี่ยอยู่ที่ 12 – 15 ปี \n" +
            "ลักษณะขน: มอลทีสมีขนสีขาวยาวสลวย นุ่มน่าสัมผัส"
        };

        public static List<string> Character { get; set; } = new List<string>()
        {
            "ร็อตไวเลอร์เป็นสุนัขที่เชื่อฟังมาก และสามารถฝึกได้ง่าย \n" +
            "สุนัขร็อตไวเลอร์มีความจงรักภักดีสูง ทั้งรักและติดเจ้าของ \n" +
            "สายพันธุ์นี้ค่อนข้างนิ่งและสงบ จนบางครั้งอาจดูเหมือนพวกเค้ารักสันโดษ \n" +
            "สุนัขพันธุ์ร็อตไวเลอร์ไม่ชอบการอยู่ลำพังเป็นเวลานาน ๆ หลายชั่วโมง หากต้องการปล่อยให้อยู่คนเดียวอาจต้องฝึกพวกเค้าอย่างเหมาะสม \n" +
            "สุนัขพันธุ์นี้มีสัญชาตญาณในการป้องกันสูง พวกเค้าพร้อมจะปกป้องคนที่รัก และจะคอยระวังคนแปลกหน้าอยู่เสมอ",

            "ด้วยนิสัยเป็นมิตร เราสามารถปล่อยให้โกลเด้น รีทรีฟเวอร์อยู่ร่วมกับเด็ก ๆ ได้โดยไร้กังวล \n" +
            "สุนัขโกลเด้น รีทรีฟเวอร์ฝึกได้ง่าย และชอบเอาใจเจ้าของด้วยการเรียนรู้ทริคต่าง ๆ อย่างรวดเร็ว \n" +
            "สุนัขพันธุ์นี้มีแนวโน้มที่จะกัดแทะสิ่งของ ดังนั้นจึงควรเก็บของที่แตกง่ายและข้าวของสำคัญให้มิดชิด \n" +
            "โกลเด้นจะเห่าเมื่อจำเป็นเท่านั้น \n" +
            "สุนัขโกลเด้น รีทรีฟเวอร์ซื่อสัตย์ และจงรักภักดี พวกเค้าเหมาะกับผู้เลี้ยงมือใหม่เป็นที่สุด",

            "บิชอง ฟริเซ่เป็นสุนัขที่น่ารัก นิสัยดี เป็นมิตร อ่อนโยน และรักครอบครัวมาก \n" +
            "พวกเค้าจึงเป็นเพื่อนที่ดีและเป็นสมาชิกครอบครัวที่ยอดเยี่ยม \n" +
            "เจ้าก้อนขนฟูเหล่านี้เหมาะสำหรับเลี้ยงในบ้านมากกว่านอกบ้าน พวกเค้าพร้อมเล่นและพร้อมพุ่งตัวเข้าสู่อ้อมกอดเจ้าของอยู่ตลอดเวลา \n" +
            "เป็นสายพันธุ์ที่เต็มไปด้วยพลังบวกและความสดใส พวกเค้าจึงเหมาะกับคนในทุกช่วงวัย นอกจากนี้พวกเค้ายังเข้ากับสัตว์เลี้ยงชนิดอื่นได้ดี \n" +
            "หากแนะนำและเข้าหาอย่างถูกวิธี",

            "สุนัขมอลทีสเข้ากับเด็ก ผู้สูงอายุ และสัตว์เลี้ยงชนิดอื่นได้ดี \n" +
            "มอลทีสชอบเล่นและฝึกได้ง่าย \n" +
            "แม้จะมีขนยาว แต่ขนไม่ค่อยร่วง- \n" +
            "มอลทีสเหมาะกับการเลี้ยงในพื้นที่น้อยอย่างในอพาร์ทเมนท์ \n" +
            "สุนัขพันธุ์นี้ไม่จำเป็นต้องออกกำลังกายหนัก"
        };
    }
}
